{
  "navigation.show": "Show navigation",
  "navigation.hide": "Hide navigation",
  "navigation.section.home": "Home",
  "navigation.section.about": "About",
  "navigation.section.activity": "Activity",
  "navigation.section.resume": "Resume",
  "navigation.section.tools": "Tools",
  "navigation.section.contact": "Contact",
  "home.title": "I am Anton Johansson",
  "home.description": "I am a programmer and a DevOps engineer.",
  "about.title": "About me",
  "about.description": [
    "I'm ${age} years old, living in Borås, Sweden. I currently work for a company called Viskan System AB, where we develop, maintain and supply an E-commerce platform and an associated back-office system. I do a lot of coding during my day but I also tend to lean a lot towards the dev-ops direction, working with build pipelines and adapt applications for containerised environments.",
    "Other than coding I like to play computer games. Currently it's mostly Rocket League where I play in a league called Svenska Raketligan. Hit me up using my Steam profile!"
  ],
  "about.seo.meta": "A ${age} year old developer from Borås, Sweden.",
  "about.contact": "Contact details",
  "about.website": "https://anton-johansson.com",
  "activity.title": "Activity",
  "activity.spotify.currently-listening-to": "Currently listening to",
  "activity.spotify.not-playing": "Not listening to anything.",
  "activity.steam.currently-playing": "Currently playing",
  "activity.steam.not-playing": "Not playing anything.",
  "resume.education.title": "Education",
  "resume.work.title": "Work",
  "resume.skills.title": "Skills",
  "contact.form": "Feel free to contact me using this form:",
  "contact.raw-email": "Or send me an e-mail directly using this address:",
  "contact.form.name": "Name",
  "contact.form.email": "E-mail address",
  "contact.form.message": "Message...",
  "contact.form.send": "Send",
  "contact.form.fields-missing": "Not all fields are given",
  "contact.form.success": "E-mail sent!",
  "education.highschool.name": "John Bauer gymnasium",
  "education.highschool.specialization": "IT program",
  "education.highschool.description": "An all-in-all basic IT program with classes varying from programming to regular Unix usage. A very chill place where I got to know many of my cloest friends today, however I must admit that the education itself wasn't very rewarding.",
  "education.university.name": "Borås University",
  "education.university.specialization": "System architect",
  "education.university.description": "A three-year lasting bachelor degree that was very well balanced around theory and practical excersices, learning different kinds of programming languages, technices and also different project management styles. I knew must of the practical things at this time, but it was educational to just practice it with other people and discuss with like-minded people.",
  "work.viskan-developer.name": "Viskan System AB",
  "work.viskan-developer.title": "System developer",
  "work.viskan-developer.description": "Originally hired as a backend developer (mainly Java and SQL), I've been doing a lot of coding and big refactorings of older applications. Smoothly transitioning more into the \"DevOps\"-area, working with setting up new tools such as Jenkins, Nexus, GitLab and Mattermost. I've also been improving our build pipelines by configuring Maven builds, Jenkins pipelines and deployment scripts. Lately, I've been working a lot with containerisation, trying out both Docker Swarm and Kubernetes. Transitioning our applications to a containerised environment has been a very rewarding and fun journey.",
  "work.viskan-partner.name": "Viskan System AB",
  "work.viskan-partner.title": "Partner and integration",
  "work.viskan-partner.description": "With this role, I got responsibility over our integrations with third parties and the technical communication with them. This was mainly focused on our third party payment service providers, building a solid framework for processing payments through our E-commerce platform and further down the flows in the back-office system, handling order cancellations, invoice activations and returns.",
  "month.1": "January",
  "month.2": "February",
  "month.3": "Mars",
  "month.4": "April",
  "month.5": "May",
  "month.6": "June",
  "month.7": "July",
  "month.8": "August",
  "month.9": "September",
  "month.10": "October",
  "month.11": "November",
  "month.12": "December",
  "too-many-requests": "Please wait a bit until you send more messages",
  "unknown-error": "An unknown error occurred",
  "present": "present"
}
